In [ ]:
import pandas as pd
import numpy as np


s=pd.Series([1,2,3,6,5,4])
print(s)

0    1
1    2
2    3
3    6
4    5
5    4
dtype: int64

In [ ]:
sum=s.sum()

In [ ]:
s.min()

1

In [ ]:
s.max()

6

In [ ]:
import pandas as pd

data=[['Dinesh',10],['Nithya',12],['Raji',13]]
df=pd.DataFrame(data,columns=['name','age'])
df

     name  age
0  Dinesh   10
1  Nithya   12
2    Raji   13

In [ ]:
data = {'Name':['Kavitha', 'Sudha', 'Raju','Vignesh'],'Age':[28,34,29,42]}
df = pd.DataFrame(data, index=['rank1','rank2','rank3','rank4'])
df

          Name  Age
rank1  Kavitha   28
rank2    Sudha   34
rank3     Raju   29
rank4  Vignesh   42

In [ ]:
df1=pd.DataFrame({'A':pd.Timestamp('20130102'),'B':np.array([3]*4,dtype='int32'),'C':pd.Categorical(['Male','Female','Male','Female'])})
df1

           A  B       C
0 2013-01-02  3    Male
1 2013-01-02  3  Female
2 2013-01-02  3    Male
3 2013-01-02  3  Female

In [ ]:
df1.shape

(4, 3)

In [ ]:
df1.dtypes

A    datetime64[ns]
B             int32
C          category
dtype: object

In [ ]:
df1.head()

           A  B       C
0 2013-01-02  3    Male
1 2013-01-02  3  Female
2 2013-01-02  3    Male
3 2013-01-02  3  Female

In [ ]:
df1.tail()

           A  B       C
0 2013-01-02  3    Male
1 2013-01-02  3  Female
2 2013-01-02  3    Male
3 2013-01-02  3  Female

In [ ]:
type(df1)

pandas.core.frame.DataFrame

In [ ]:
# df1.summary()

In [ ]:
df1.T

                     0  ...                    3
A  2013-01-02 00:00:00  ...  2013-01-02 00:00:00
B                    3  ...                    3
C                 Male  ...               Female

[3 rows x 4 columns]

In [ ]:
df1

           A  B       C
0 2013-01-02  3    Male
1 2013-01-02  3  Female
2 2013-01-02  3    Male
3 2013-01-02  3  Female

In [ ]:
df1.sort_index(axis=0,ascending=False)

           A  B       C
3 2013-01-02  3  Female
2 2013-01-02  3    Male
1 2013-01-02  3  Female
0 2013-01-02  3    Male

In [ ]:
df1.sort_index(axis=0,ascending=True)

           A  B       C
0 2013-01-02  3    Male
1 2013-01-02  3  Female
2 2013-01-02  3    Male
3 2013-01-02  3  Female

In [ ]:
df1.sort_index(axis=1,ascending=False)

        C  B          A
0    Male  3 2013-01-02
1  Female  3 2013-01-02
2    Male  3 2013-01-02
3  Female  3 2013-01-02

In [ ]:
dates=pd.date_range('20200301',periods=100)
dates

DatetimeIndex(['2020-03-01', '2020-03-02', '2020-03-03', '2020-03-04',
               '2020-03-05', '2020-03-06', '2020-03-07', '2020-03-08',
               '2020-03-09', '2020-03-10', '2020-03-11', '2020-03-12',
               '2020-03-13', '2020-03-14', '2020-03-15', '2020-03-16',
               '2020-03-17', '2020-03-18', '2020-03-19', '2020-03-20',
               '2020-03-21', '2020-03-22', '2020-03-23', '2020-03-24',
               '2020-03-25', '2020-03-26', '2020-03-27', '2020-03-28',
               '2020-03-29', '2020-03-30', '2020-03-31', '2020-04-01',
               '2020-04-02', '2020-04-03', '2020-04-04', '2020-04-05',
               '2020-04-06', '2020-04-07', '2020-04-08', '2020-04-09',
               '2020-04-10', '2020-04-11', '2020-04-12', '2020-04-13',
               '2020-04-14', '2020-04-15', '2020-04-16', '2020-04-17',
               '2020-04-18', '2020-04-19', '2020-04-20', '2020-04-21',
               '2020-04-22', '2020-04-23', '2020-04-24', '2020-04-25',
               '2020-04-26', '2020-04-27', '2020-04-28', '2020-04-29',
               '2020-04-30', '2020-05-01', '2020-05-02', '2020-05-03',
               '2020-05-04', '2020-05-05', '2020-05-06', '2020-05-07',
               '2020-05-08', '2020-05-09', '2020-05-10', '2020-05-11',
               '2020-05-12', '2020-05-13', '2020-05-14', '2020-05-15',
               '2020-05-16', '2020-05-17', '2020-05-18', '2020-05-19',
               '2020-05-20', '2020-05-21', '2020-05-22', '2020-05-23',
               '2020-05-24', '2020-05-25', '2020-05-26', '2020-05-27',
               '2020-05-28', '2020-05-29', '2020-05-30', '2020-05-31',
               '2020-06-01', '2020-06-02', '2020-06-03', '2020-06-04',
               '2020-06-05', '2020-06-06', '2020-06-07', '2020-06-08'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
df=pd.DataFrame(np.random.randn(100,5),index=dates,columns=list('ABCDE'))
df

                   A         B         C         D         E
2020-03-01 -0.135540 -0.856945  1.693464 -0.035213 -0.918129
2020-03-02  0.525037  0.589724 -1.103871  0.588731 -1.214577
2020-03-03 -0.381519  2.530363 -0.431943  1.391267 -0.506570
2020-03-04 -0.114909 -0.971451  2.042069 -2.583280 -2.385616
2020-03-05  0.528383  0.583538 -1.484305 -0.639642 -0.829156
...              ...       ...       ...       ...       ...
2020-06-04 -0.528134 -2.097465 -1.789905 -0.765978 -2.658492
2020-06-05 -0.669089 -1.579957 -0.771902  0.923702 -1.701865
2020-06-06 -0.435860 -0.409949  0.225786 -0.313428  2.124608
2020-06-07 -1.308892  0.413231  0.432763 -2.534826  1.229016
2020-06-08 -1.099797  0.671590 -0.107543 -0.650736 -2.256376

[100 rows x 5 columns]

In [ ]:
df.index

DatetimeIndex(['2020-03-01', '2020-03-02', '2020-03-03', '2020-03-04',
               '2020-03-05', '2020-03-06', '2020-03-07', '2020-03-08',
               '2020-03-09', '2020-03-10', '2020-03-11', '2020-03-12',
               '2020-03-13', '2020-03-14', '2020-03-15', '2020-03-16',
               '2020-03-17', '2020-03-18', '2020-03-19', '2020-03-20',
               '2020-03-21', '2020-03-22', '2020-03-23', '2020-03-24',
               '2020-03-25', '2020-03-26', '2020-03-27', '2020-03-28',
               '2020-03-29', '2020-03-30', '2020-03-31', '2020-04-01',
               '2020-04-02', '2020-04-03', '2020-04-04', '2020-04-05',
               '2020-04-06', '2020-04-07', '2020-04-08', '2020-04-09',
               '2020-04-10', '2020-04-11', '2020-04-12', '2020-04-13',
               '2020-04-14', '2020-04-15', '2020-04-16', '2020-04-17',
               '2020-04-18', '2020-04-19', '2020-04-20', '2020-04-21',
               '2020-04-22', '2020-04-23', '2020-04-24', '2020-04-25',
               '2020-04-26', '2020-04-27', '2020-04-28', '2020-04-29',
               '2020-04-30', '2020-05-01', '2020-05-02', '2020-05-03',
               '2020-05-04', '2020-05-05', '2020-05-06', '2020-05-07',
               '2020-05-08', '2020-05-09', '2020-05-10', '2020-05-11',
               '2020-05-12', '2020-05-13', '2020-05-14', '2020-05-15',
               '2020-05-16', '2020-05-17', '2020-05-18', '2020-05-19',
               '2020-05-20', '2020-05-21', '2020-05-22', '2020-05-23',
               '2020-05-24', '2020-05-25', '2020-05-26', '2020-05-27',
               '2020-05-28', '2020-05-29', '2020-05-30', '2020-05-31',
               '2020-06-01', '2020-06-02', '2020-06-03', '2020-06-04',
               '2020-06-05', '2020-06-06', '2020-06-07', '2020-06-08'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
df.columns

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [ ]:
df.sort_index(axis=0,ascending=True)

                   A         B         C         D         E
2020-03-01 -0.135540 -0.856945  1.693464 -0.035213 -0.918129
2020-03-02  0.525037  0.589724 -1.103871  0.588731 -1.214577
2020-03-03 -0.381519  2.530363 -0.431943  1.391267 -0.506570
2020-03-04 -0.114909 -0.971451  2.042069 -2.583280 -2.385616
2020-03-05  0.528383  0.583538 -1.484305 -0.639642 -0.829156
...              ...       ...       ...       ...       ...
2020-06-04 -0.528134 -2.097465 -1.789905 -0.765978 -2.658492
2020-06-05 -0.669089 -1.579957 -0.771902  0.923702 -1.701865
2020-06-06 -0.435860 -0.409949  0.225786 -0.313428  2.124608
2020-06-07 -1.308892  0.413231  0.432763 -2.534826  1.229016
2020-06-08 -1.099797  0.671590 -0.107543 -0.650736 -2.256376

[100 rows x 5 columns]

In [ ]:
df[0:3]

                   A         B         C         D         E
2020-03-01 -0.135540 -0.856945  1.693464 -0.035213 -0.918129
2020-03-02  0.525037  0.589724 -1.103871  0.588731 -1.214577
2020-03-03 -0.381519  2.530363 -0.431943  1.391267 -0.506570

In [ ]:
df.iloc[0]

A   -0.135540
B   -0.856945
C    1.693464
D   -0.035213
E   -0.918129
Name: 2020-03-01 00:00:00, dtype: float64

In [ ]:
df.iloc[0:3]

                   A         B         C         D         E
2020-03-01 -0.135540 -0.856945  1.693464 -0.035213 -0.918129
2020-03-02  0.525037  0.589724 -1.103871  0.588731 -1.214577
2020-03-03 -0.381519  2.530363 -0.431943  1.391267 -0.506570

In [ ]:
# df[0,:2]

In [77]:
df.iloc[0:10,:2]

                   A         B
2020-03-01 -0.135540 -0.856945
2020-03-02  0.525037  0.589724
2020-03-03 -0.381519  2.530363
2020-03-04 -0.114909 -0.971451
2020-03-05  0.528383  0.583538
2020-03-06 -0.839623  0.650944
2020-03-07  0.337035  0.288683
2020-03-08  0.422639 -1.048588
2020-03-09  0.273666 -0.123409
2020-03-10  1.860097 -0.063118

In [85]:
df['A']

2020-03-01   -0.135540
2020-03-02    0.525037
2020-03-03   -0.381519
2020-03-04   -0.114909
2020-03-05    0.528383
                ...
2020-06-04   -0.528134
2020-06-05   -0.669089
2020-06-06   -0.435860
2020-06-07   -1.308892
2020-06-08   -1.099797
Freq: D, Name: A, Length: 100, dtype: float64

In [87]:
df[['A','B']]

                   A         B
2020-03-01 -0.135540 -0.856945
2020-03-02  0.525037  0.589724
2020-03-03 -0.381519  2.530363
2020-03-04 -0.114909 -0.971451
2020-03-05  0.528383  0.583538
...              ...       ...
2020-06-04 -0.528134 -2.097465
2020-06-05 -0.669089 -1.579957
2020-06-06 -0.435860 -0.409949
2020-06-07 -1.308892  0.413231
2020-06-08 -1.099797  0.671590

[100 rows x 2 columns]

In [88]:

df[['A','B']][0:5]

                   A         B
2020-03-01 -0.135540 -0.856945
2020-03-02  0.525037  0.589724
2020-03-03 -0.381519  2.530363
2020-03-04 -0.114909 -0.971451
2020-03-05  0.528383  0.583538

In [92]:
df[df.A>1.1]

                   A         B         C         D         E
2020-03-10  1.860097 -0.063118 -1.211742 -0.734412  0.678620
2020-03-19  1.365924 -0.725494  0.164184  0.877042 -1.026324
2020-03-22  1.149846  1.345813  0.042598  0.768228 -0.581573
2020-03-23  1.767685  1.599902  0.278222 -0.725061 -0.288093
2020-03-28  1.321573  1.778219  2.546331 -1.031908 -2.998553
2020-04-09  1.415636  0.449360  0.385754 -1.903136  0.795246
2020-04-13  1.161977 -0.229682  0.404596 -0.209445  1.396322
2020-04-14  1.828122 -1.472529  0.820434  1.564382  0.600352
2020-04-26  1.701895  1.273218 -0.262805  2.217302  0.199351
2020-04-29  1.385251  0.722171 -0.233534  0.537598  0.472454
2020-05-11  1.114075  0.550027 -1.904939  1.670767 -1.950095
2020-05-12  1.634651 -0.064830  0.070851 -0.254554  1.233374
2020-05-18  1.253775 -0.321734 -1.968177 -0.891829  0.711485
2020-05-26  2.327715 -3.959199  1.071337 -0.728214  0.663206
2020-05-28  1.805349 -0.249275 -0.574841  1.228307 -0.365502

In [98]:
df.drop('A',axis=1,inplace=False)

                   B         C         D         E
2020-03-01 -0.856945  1.693464 -0.035213 -0.918129
2020-03-02  0.589724 -1.103871  0.588731 -1.214577
2020-03-03  2.530363 -0.431943  1.391267 -0.506570
2020-03-04 -0.971451  2.042069 -2.583280 -2.385616
2020-03-05  0.583538 -1.484305 -0.639642 -0.829156
...              ...       ...       ...       ...
2020-06-04 -2.097465 -1.789905 -0.765978 -2.658492
2020-06-05 -1.579957 -0.771902  0.923702 -1.701865
2020-06-06 -0.409949  0.225786 -0.313428  2.124608
2020-06-07  0.413231  0.432763 -2.534826  1.229016
2020-06-08  0.671590 -0.107543 -0.650736 -2.256376

[100 rows x 4 columns]

In [99]:
df

                   A         B         C         D         E
2020-03-01 -0.135540 -0.856945  1.693464 -0.035213 -0.918129
2020-03-02  0.525037  0.589724 -1.103871  0.588731 -1.214577
2020-03-03 -0.381519  2.530363 -0.431943  1.391267 -0.506570
2020-03-04 -0.114909 -0.971451  2.042069 -2.583280 -2.385616
2020-03-05  0.528383  0.583538 -1.484305 -0.639642 -0.829156
...              ...       ...       ...       ...       ...
2020-06-04 -0.528134 -2.097465 -1.789905 -0.765978 -2.658492
2020-06-05 -0.669089 -1.579957 -0.771902  0.923702 -1.701865
2020-06-06 -0.435860 -0.409949  0.225786 -0.313428  2.124608
2020-06-07 -1.308892  0.413231  0.432763 -2.534826  1.229016
2020-06-08 -1.099797  0.671590 -0.107543 -0.650736 -2.256376

[100 rows x 5 columns]